system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
        maxIter         100;
    }

    "alpha.water.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;
        cAlpha          1;
        icAlpha         0;
        scAlpha         0;

        MULESCorr       yes;
        nLimiterIter    3;
        alphaApplyPrevCorr  no;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    p_rgh
{
    solver          GAMG;
    tolerance       1e-8;
    relTol          0.05;
    smoother        DILU;
    cacheAgglomeration true;
    nPreSweeps      1;
    nPostSweeps     2;
    nFinestSweeps   2;
    scaleCorrection true;
}

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    pcorr
    {
        $p;
        solver          PCG;
        preconditioner  DIC;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
        maxIter         200;
        minIter         1;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    correctPhi          no;
    nOuterCorrectors    3;
    nCorrectors         3;
    nNonOrthogonalCorrectors 1;

    pRefPoint           (-500 0 -500);
    //(0.0002 0.0099 0.001);
    pRefValue           0.0;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        ".*"             1;
    }
}


// ************************************************************************* //
