system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  regionsToCell;
        insidePoints ((1 1 1));
    }

    {
        name    c1;
        type    cellSet;
        action  new;
        source  cellToCell;
        set     c0;
    }

    {
        name    c1;
        type    cellSet;
        action  invert;
    }

    /*{
        name    c2;
        type    cellSet;
        action  new;
        source  regionsToCell;
        //insidePoints ((1.16 0.151 2.5));
        insidePoints ((500 500 500));

        set     c1;
    }*/

    {
        name    c1;
        type    cellSet;
        action  subtract;
        source  cellToCell;
        set     c1;
    }

    // Select box to remove from region 1 and 2
    {
        name    box;
        type    cellSet;
        action  new;
        source  cellToCell;
        set     c1;
    }

    /*{
        name    box;
        type    cellSet;
        action  add;
        source  cellToCell;
        set     c2;
    }*/

    {
        name    box;
        type    cellSet;
        action  subset;
        source  boxToCell;
        boxes
        (
            /*(0.025 0.045 -1000)(0.075 0.055 1000)
            (0.125 0.025 -1000)(0.135 0.075 1000)*/
            ( -20  -95  -20) ( 20  95  20)
        );
    }

    {
        name    box;
        type    cellSet;
        action  invert;
    }
);


// ************************************************************************* //
